src/config/Documents/ВосстановлениеНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ВосстановлениеНДС</Name>
			<Comment>Восстановление сумм НДС ранее принятых к вычету, право на применение вычета по которым впоследствии исчезло</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСПокупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/НДСПокупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПокупки</Name>
			<Comment>(Регл) НДС, предъявляемый к вычету</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияПоНДСПокупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Enums/СобытияПоНДСПокупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СобытияПоНДСПокупки</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплаченНДСНаТаможне</Name>
					<Comment>факт уплаты таможенного НДС при импорте товаров (по ГТД)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНДСНаСтроительство</Name>
					<Comment>Событие обозначающее передачу ТМЦ на строительство основных средств</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСВведеноВЭксплуатацию</Name>
					<Comment>факт ввода ОС, к которому относится НДС, в эксплуатацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Comment>регистрируется факт включения НДС в стоимость приобретенной ценности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредполагаетсяСтавка0</Name>
					<Comment>для регистрации факта, что этот НДС связан с предполагаемым применения ставки НДС 0% при реализации и не подлежит вычету</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержденаСтавка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановленНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСКВычету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредъявленНДСКВычету0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ВосстановлениеНДС/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	СобытияПоступления = Новый СписокЗначений;
	СобытияПоступления.Добавить(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком);
	СобытияПоступления.Добавить(Перечисления.СобытияПоНДСПокупки.УплаченНДСНаТаможне);
	СобытияПоступления.Добавить(Перечисления.СобытияПоНДСПокупки.ВосстановленНДС);

	СобытияМинусПоступления = Новый СписокЗначений;
	СобытияМинусПоступления.Добавить(Перечисления.СобытияПоНДСПокупки.Возврат);
	
	УчитываемыеСобытия = Новый СписокЗначений;
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСПоставщиком);
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.УплаченНДСНаТаможне);
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету);
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.ВосстановленНДС);
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.ПредполагаетсяСтавка0);
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.НДСВключенВСтоимость);
	УчитываемыеСобытия.Добавить(Перечисления.СобытияПоНДСПокупки.Возврат);

	СобытияПричиныВосстановления = Новый СписокЗначений;
	СобытияПричиныВосстановления.Добавить(Перечисления.СобытияПоНДСПокупки.ПредполагаетсяСтавка0);
	СобытияПричиныВосстановления.Добавить(Перечисления.СобытияПоНДСПокупки.НДСВключенВСтоимость);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("Регистратор",                  Ссылка);
	Запрос.УстановитьПараметр("КонецПериода",                 КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("УчитываемыеСобытия",           УчитываемыеСобытия); // Установим фильтр обрабатываемых событий в регистре "НДСПокупки"
	Запрос.УстановитьПараметр("СобытияПоступления",           СобытияПоступления); // События, формирующие сумму, которая потенциально может быть признана к вычету
	Запрос.УстановитьПараметр("СобытияМинусПоступления",      СобытияМинусПоступления); // События, формирующие сумму, которая потенциально может быть признана к вычету
	Запрос.УстановитьПараметр("СобытиеВычетНДС",              Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету);
	Запрос.УстановитьПараметр("СобытиеПричиныВосстановления", СобытияПричиныВосстановления);// Причины по которы может понадобится восстановление НДС принятого ранее к вычету
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НДСПокупки.ВидЦенности КАК ВидЦенности,
	|	НДСПокупки.Поставщик   КАК Поставщик,
	|	НДСПокупки.СчетФактура КАК СчетФактура,
	|	НДСПокупки.СтавкаНДС   КАК СтавкаНДС,
	|	СУММА(ВЫБОР КОГДА НДСПокупки.Событие В (&СобытияПоступления)           ТОГДА НДСПокупки.СуммаБезНДС КОГДА НДСПокупки.Событие В (&СобытияМинусПоступления) ТОГДА - НДСПокупки.СуммаБезНДС ИНАЧЕ 0 КОНЕЦ) КАК ПредъявленоСумма,
	|	СУММА(ВЫБОР КОГДА НДСПокупки.Событие В (&СобытияПоступления)           ТОГДА НДСПокупки.НДС         КОГДА НДСПокупки.Событие В (&СобытияМинусПоступления) ТОГДА - НДСПокупки.НДС 		 ИНАЧЕ 0 КОНЕЦ) КАК ПредъявленоНДС,
	|	СУММА(ВЫБОР КОГДА НДСПокупки.Событие = &СобытиеВычетНДС                ТОГДА НДСПокупки.СуммаБезНДС ИНАЧЕ 0 КОНЕЦ) КАК ВычетСумма,
	|	СУММА(ВЫБОР КОГДА НДСПокупки.Событие = &СобытиеВычетНДС                ТОГДА НДСПокупки.НДС         ИНАЧЕ 0 КОНЕЦ) КАК ВычетНДС,
	|	СУММА(ВЫБОР КОГДА НДСПокупки.Событие В (&СобытиеПричиныВосстановления) ТОГДА НДСПокупки.СуммаБезНДС ИНАЧЕ 0 КОНЕЦ) КАК НужноВосстановитьСумма,
	|	СУММА(ВЫБОР КОГДА НДСПокупки.Событие В (&СобытиеПричиныВосстановления) ТОГДА НДСПокупки.НДС         ИНАЧЕ 0 КОНЕЦ) КАК НужноВосстановитьНДС
	|ИЗ
	|	РегистрНакопления.НДСПокупки КАК НДСПокупки
	|
	|ГДЕ
	|	НДСПокупки.Период      <= &КонецПериода И
	|	НДСПокупки.Регистратор <> &Регистратор  И
	|	НДСПокупки.Организация =  &Организация  И
	|	НДСПокупки.Событие     В  (&УчитываемыеСобытия)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСПокупки.ВидЦенности,
	|	НДСПокупки.Поставщик,
	|	НДСПокупки.СчетФактура,
	|	НДСПокупки.СтавкаНДС";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл

		СуммаВосстановления = 0;

		Если (Выборка.ПредъявленоСумма > 0)
		   и (Выборка.ВычетСумма > 0)
		   и (Выборка.НужноВосстановитьСумма >= 0) Тогда

			// Требуется произвести расчет базы для НДС, ранее принятой к вычету, но в связи с утратой права на
			// данный вычет, подлежащей восстановлению

			МожетБытьПринятоКВычетуСумма = Выборка.ПредъявленоСумма - Выборка.НужноВосстановитьСумма;

			Если (МожетБытьПринятоКВычетуСумма < Выборка.ВычетСумма)
			   и (МожетБытьПринятоКВычетуСумма >= 0) Тогда

				СуммаВосстановления = Выборка.ВычетСумма - МожетБытьПринятоКВычетуСумма;

			ИначеЕсли МожетБытьПринятоКВычетуСумма < 0 Тогда

				СуммаВосстановления = Выборка.ВычетСумма;

			КонецЕсли;

		КонецЕсли;

		НДСВосстановления = 0;

		Если (Выборка.ПредъявленоНДС > 0)
		   и (Выборка.ВычетНДС > 0)
		   и (Выборка.НужноВосстановитьНДС >= 0) Тогда

			// Требуется произвести расчет суммы НДС, ранее принятой к вычету, но в связи с утратой права на
			// данный вычет, подлежащей восстановлению

			МожетБытьПринятоКВычетуНДС = Выборка.ПредъявленоНДС - Выборка.НужноВосстановитьНДС;

			Если (МожетБытьПринятоКВычетуНДС < Выборка.ВычетНДС)
			   и (МожетБытьПринятоКВычетуНДС >= 0) Тогда

				НДСВосстановления = Выборка.ВычетНДС - МожетБытьПринятоКВычетуНДС;

			ИначеЕсли МожетБытьПринятоКВычетуНДС < 0 Тогда

				НДСВосстановления = Выборка.ВычетНДС;

			КонецЕсли;

		КонецЕсли;

		Если (СуммаВосстановления <> 0) или (НДСВосстановления <> 0) Тогда

			// получаем таблицу идентичную по структуре движениям регистра "НДСПокупки"
			ТаблицаПоступлений = Движения.НДСПокупки.Выгрузить();
			ТаблицаПоступлений.Очистить();
			
			СтрокаДвижения = Движения.НДСПокупки.Добавить();

			СтрокаДвижения.Период       = Дата;
			СтрокаДвижения.Организация  = Организация;
			СтрокаДвижения.ВидЦенности  = Выборка.ВидЦенности;
			СтрокаДвижения.Поставщик    = Выборка.Поставщик;
			СтрокаДвижения.СчетФактура  = Выборка.СчетФактура;
			СтрокаДвижения.Событие      = Перечисления.СобытияПоНДСПокупки.ВосстановленНДС;
			СтрокаДвижения.СтавкаНДС    = Выборка.СтавкаНДС;
			СтрокаДвижения.СуммаБезНДС  = СуммаВосстановления;
			СтрокаДвижения.НДС          = НДСВосстановления;

		КонецЕсли; //Если (СуммаВосстановления <> 0) или (НДСВосстановления <> 0) Тогда

	КонецЦикла; // Пока Выборка.Следующий() Цикл

КонецПроцедуры // ОбработкаПроведения(

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры
